def check_ferm_t(a,b,c,n):
    print("Входные данные:\n","a =", a,"\n","b =",b,"\n","c =",c,"\n","Значение степени N:",n,"\n")
    print("Введённое уравнение выглядит следующим образом:\n")
    print("(",a,"^",n,")","+","(",b,"^",n,")","=","(",c,"^",n,")","\n")
    if a**n + b**n == c**n:
        print("Ферма ошибся! Уравнение верно!")
    else:
        print(a**n + b**n,"не равно",c**n)
        print("Теорема Ферма верна!")


def ferma_input():
    a = int(input("Введите значение A: "))
    b = int(input("Введите значение B: "))
    c = int(input("Введите значение С: "))
    n = int(input("Введите значение степени N: "))
    if n<=2:
        print("Неверное значение степени N. Чтобы проверить теорему Ферма, пожалуйста введите значение N > 2.")
    else:
        check_ferm_t(a, b, c, n)


ferma_input()
